package Variable.IfElse;
//Определение буквы, числа или символа по их коду
//создайте переменную типа char
//присвойте ей значение ‘\u0057’
//определите — это код буквы, числа или другого символа
//использовать для этого методы классов Java запрещено!
//выведите в консоль сам символ и информацию о нем:
//маленькая (большая) буква
//это число
//не буква и не число
public class IfElseStatement5 {
    public static void main(String[] args) {
        char A = '\u0057';
        String m = "W";
        System.out.println("\u0057");

    }
}
